In [1]:
import pandas as pd
import numpy as np
# Grouping Data

df = pd.read_csv('cities.tsv', sep='\t', names=['date', 'city', 'value'])
print(df)

          date    city  value
0   2000-01-03  London      6
1   2000-01-04  London      3
2   2000-01-05  London      4
3   2000-01-03  Mexico      3
4   2000-01-04  Mexico      9
5   2000-01-05  Mexico      8
6   2000-01-03  Mumbai     12
7   2000-01-04  Mumbai      9
8   2000-01-05  Mumbai      8
9   2000-01-03   Tokyo      5
10  2000-01-04   Tokyo      5
11  2000-01-05   Tokyo      6

In [7]:
#group the data by city names and find the max Temperature value per city using .max()
grouped = df.groupby(["city", "value"])
print(grouped["value"].max())

city    value
London  3         3
        4         4
        6         6
Mexico  3         3
        8         8
        9         9
Mumbai  8         8
        9         9
        12       12
Tokyo   5         5
        6         6
Name: value, dtype: int64

In [8]:
print(grouped["value"].sum())
#sum of value per city
print(df['value'].groupby(df['city']).sum())

city    value
London  3         3
        4         4
        6         6
Mexico  3         3
        8         8
        9         9
Mumbai  8         8
        9         9
        12       12
Tokyo   5        10
        6         6
Name: value, dtype: int64
city
London    13
Mexico    20
Mumbai    29
Tokyo     16
Name: value, dtype: int64

In [10]:
#reshape data by having the dates as an index and the cities as columns using .pivot
pv = df.pivot("date", "city", "value")
pv

city        London  Mexico  Mumbai  Tokyo
date
2000-01-03       6       3      12      5
2000-01-04       3       9       9      5
2000-01-05       4       8       8      6

In [11]:
#Get max function on this new DataFrame
pv.max(axis=1)

date
2000-01-03    12
2000-01-04     9
2000-01-05     8
dtype: int64

In [2]:
df = pd.read_csv("sunshine.tsv", sep='\t', names=['country', 'city', 'date', 'hours'])

print(df.head())
print(df.groupby("city").describe())
print(df.groupby(["country", "date"]).describe())
print(df.groupby("city").mean())
print(df.groupby("city").agg(np.mean))
print(df.groupby("city").agg(lambda s: abs(min(s) - max(s))))

   country     city        date  hours
0  Germany  Hamburg  2015-06-01      4
1  Germany  Hamburg  2015-06-02      7
2  Germany  Hamburg  2015-06-03      0
3  Germany  Hamburg  2015-06-04      7
4  Germany  Hamburg  2015-06-05      4
           hours
           count mean       std  min   25%  50%   75%   max
city
Berlin      10.0  4.8  3.705851  0.0  1.25  5.0  8.25   9.0
Birmingham  10.0  4.7  3.860052  0.0  1.25  4.0  8.00  10.0
Bordeax     10.0  6.2  2.936362  2.0  4.25  6.5  8.00  10.0
Edinburgh   10.0  5.2  3.293090  0.0  2.50  6.0  7.75   9.0
Frankfurt   10.0  4.2  2.201010  0.0  3.00  4.0  5.75   7.0
Glasgow     10.0  5.0  3.681787  1.0  2.00  4.5  8.00  10.0
Hamburg     10.0  5.2  2.936362  0.0  4.00  5.0  7.00  10.0
Leipzig     10.0  5.7  2.002776  3.0  4.25  6.0  6.75   9.0
London      10.0  5.2  3.521363  0.0  2.50  5.0  8.50  10.0
Lyon        10.0  4.0  2.828427  0.0  2.25  3.5  6.25   8.0
Manchester  10.0  3.2  2.699794  0.0  1.25  2.5  5.00   8.0
Marseille   10.0  4.8  2.936362  0.0  3.00  5.5  7.00   9.0
Munich      10.0  6.6  3.405877  0.0  5.25  7.5  9.00  10.0
Nice        10.0  5.1  2.685351  2.0  3.00  5.0  6.75  10.0
Paris       10.0  3.4  3.339993  0.0  2.00  2.0  3.00  10.0
                   hours
                   count mean       std  min  25%  50%   75%   max
country date
France  2015-06-01   5.0  5.6  3.435113  1.0  3.0  7.0   8.0   9.0
        2015-06-02   5.0  4.4  2.792848  1.0  2.0  5.0   7.0   7.0
        2015-06-03   5.0  2.0  0.707107  1.0  2.0  2.0   2.0   3.0
        2015-06-04   5.0  4.0  1.870829  2.0  3.0  4.0   4.0   7.0
        2015-06-05   5.0  3.2  2.683282  0.0  2.0  2.0   6.0   6.0
        2015-06-06   5.0  3.6  1.341641  3.0  3.0  3.0   3.0   6.0
        2015-06-07   5.0  6.8  3.271085  2.0  5.0  8.0   9.0  10.0
        2015-06-08   5.0  4.0  4.690416  0.0  0.0  2.0   8.0  10.0
        2015-06-09   5.0  7.2  2.774887  4.0  5.0  7.0  10.0  10.0
        2015-06-10   5.0  6.2  2.167948  3.0  5.0  7.0   8.0   8.0
Germany 2015-06-01   5.0  5.6  3.781534  0.0  4.0  6.0   9.0   9.0
        2015-06-02   5.0  4.8  1.788854  3.0  3.0  5.0   6.0   7.0
        2015-06-03   5.0  3.0  3.082207  0.0  0.0  3.0   5.0   7.0
        2015-06-04   5.0  6.2  0.836660  5.0  6.0  6.0   7.0   7.0
        2015-06-05   5.0  4.4  3.361547  0.0  3.0  4.0   6.0   9.0
        2015-06-06   5.0  2.6  1.949359  0.0  2.0  2.0   4.0   5.0
        2015-06-07   5.0  8.4  1.140175  7.0  8.0  8.0   9.0  10.0
        2015-06-08   5.0  5.8  3.768289  0.0  5.0  6.0   8.0  10.0
        2015-06-09   5.0  5.2  2.863564  3.0  3.0  5.0   5.0  10.0
        2015-06-10   5.0  7.0  2.000000  5.0  5.0  7.0   9.0   9.0
UK      2015-06-01   5.0  7.4  1.516575  5.0  7.0  8.0   8.0   9.0
        2015-06-02   5.0  6.8  3.271085  2.0  5.0  8.0   9.0  10.0
        2015-06-03   5.0  5.8  3.633180  1.0  3.0  7.0   9.0   9.0
        2015-06-04   5.0  4.8  3.962323  0.0  1.0  7.0   8.0   8.0
        2015-06-05   5.0  2.2  2.167948  1.0  1.0  1.0   2.0   6.0
        2015-06-06   5.0  4.4  4.722288  0.0  1.0  2.0   9.0  10.0
        2015-06-07   5.0  5.2  3.563706  1.0  2.0  6.0   8.0   9.0
        2015-06-08   5.0  3.4  4.219005  0.0  0.0  2.0   5.0  10.0
        2015-06-09   5.0  3.6  2.607681  0.0  2.0  4.0   6.0   6.0
        2015-06-10   5.0  3.0  1.414214  2.0  2.0  2.0   4.0   5.0
            hours
city
Berlin        4.8
Birmingham    4.7
Bordeax       6.2
Edinburgh     5.2
Frankfurt     4.2
Glasgow       5.0
Hamburg       5.2
Leipzig       5.7
London        5.2
Lyon          4.0
Manchester    3.2
Marseille     4.8
Munich        6.6
Nice          5.1
Paris         3.4
            hours
city
Berlin        4.8
Birmingham    4.7
Bordeax       6.2
Edinburgh     5.2
Frankfurt     4.2
Glasgow       5.0
Hamburg       5.2
Leipzig       5.7
London        5.2
Lyon          4.0
Manchester    3.2
Marseille     4.8
Munich        6.6
Nice          5.1
Paris         3.4
            hours
city
Berlin          9
Birmingham     10
Bordeax         8
Edinburgh       9
Frankfurt       7
Glasgow         9
Hamburg        10
Leipzig         6
London         10
Lyon            8
Manchester      8
Marseille       9
Munich         10
Nice            8
Paris          10